BAS BMEKZU Project/src/InformationRegisters/МетодыРаспределенияКосвенныхРасходовОрганизаций/МетодыРаспределенияКосвенныхРасходовОрганизаций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МетодыРаспределенияКосвенныхРасходовОрганизаций</name>
  <comment>(Регл)</comment>
  <informationRegisterPeriodicity>Month</informationRegisterPeriodicity>
  <resources>
    <name>СпособРаспределения</name>
    <type>
      <types>EnumRef.СпособыРаспределенияКосвенныхРасходов</types>
    </type>
  </resources>
  <resources>
    <name>СписокСтатейЗатрат</name>
    <type>
      <types>CatalogRef.СписокСтатейЗатратВключенныхВБазуРаспределенияКосвенныхРасходов</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СчетЗатрат</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

BAS BMEKZU Project/src/Enums/СпособыРаспределенияКосвенныхРасходов/СпособыРаспределенияКосвенныхРасходов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыРаспределенияКосвенныхРасходов</name>
  <comment>(Общ)</comment>
  <enumValues>
    <name>ОбъемВыпуска</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПлановаяСебестоимость</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ОплатаТруда</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>МатериальныеЗатраты</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ПрямыеЗатраты</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>ОтдельныеСтатьиПрямыхЗатрат</name>
    <comment>(Общ)</comment>
  </enumValues>
  <enumValues>
    <name>НеРаспределяется</name>
  </enumValues>
</mdclass:Enum>

BAS BMEKZU Project/src/InformationRegisters/МетодыРаспределенияКосвенныхРасходовОрганизаций/Forms/ФормаЗаписи/Module.bsl
&НаСервере
Процедура ПодготовитьФормуНаСервере()

	// ИНАГРО
	МассивСчетов = Новый Массив;
	МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.ОбщепроизводственныеРасходы);
	МассивСчетов.Добавить(ПланыСчетов.Хозрасчетный.Производство);
	СчетаДляОтбора = БухгалтерскийУчет.ПолучитьМассивСчетовССубсчетами(МассивСчетов, Ложь, , , );
			
	БухгалтерскийУчетКлиентСервер.ИзменитьПараметрыВыбораСчета(Элементы.СчетЗатрат, СчетаДляОтбора);

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Форма.Элементы.СписокСтатейЗатрат.Доступность = 
			Форма.Запись.СпособРаспределения = ПредопределенноеЗначение("Перечисление.СпособыРаспределенияКосвенныхРасходов.ОтдельныеСтатьиПрямыхЗатрат");

КонецПроцедуры
 


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПодготовитьФормуНаСервере();
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура БазаРаспределенияПриИзменении(Элемент)
	
	Если Запись.СпособРаспределения <> ПредопределенноеЗначение("Перечисление.СпособыРаспределенияКосвенныхРасходов.ОтдельныеСтатьиПрямыхЗатрат") Тогда
		Запись.СписокСтатейЗатрат = Неопределено;
	КонецЕсли; 
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры
